Updated docs folder
